admbase/src/Catalogs/УчетныеДанныеПодключений/УчетныеДанныеПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеДанныеПодключений</name>
  <predefined>
    <items>
      <name>DMC</name>
      <description>DMC</description>
    </items>
    <items>
      <name>ERP</name>
      <description>ERP</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипПодключения</name>
    <type>
      <types>EnumRef.ТипыПодключения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорневойURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WebСервисИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WebСервисИмяСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WebСервисИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WebСервисПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

admbase/src/Enums/ТипыПодключения/ТипыПодключения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключения</name>
  <enumValues>
    <name>ПодключениеCOM</name>
  </enumValues>
  <enumValues>
    <name>ПодключениеHTTP</name>
  </enumValues>
  <enumValues>
    <name>WebСервис</name>
  </enumValues>
</mdclass:Enum>

admbase/src/Catalogs/УчетныеДанныеПодключений/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	Если  ТипПодключения =  Перечисления.ТипыПодключения.WebСервис Тогда
	
		ПроверяемыеРеквизиты.Добавить("WebСервисИмяБазы");
		ПроверяемыеРеквизиты.Добавить("WebСервисИмяСервера");         
		ПроверяемыеРеквизиты.Добавить("WebСервисИмяПользователя");             
		ПроверяемыеРеквизиты.Добавить("WebСервисПароль");                  
	
	КонецЕсли;
	
	Если  ТипПодключения =  Перечисления.ТипыПодключения.ПодключениеCOM Тогда
		ПроверяемыеРеквизиты.Добавить("ИмяБазы");
		ПроверяемыеРеквизиты.Добавить("ИмяСервера");                   
		ПроверяемыеРеквизиты.Добавить("ИмяПользователя");             
		ПроверяемыеРеквизиты.Добавить("Пароль");                  
		ПроверяемыеРеквизиты.Добавить("АдресСервера");                  
		
	
	КонецЕсли;
	
	Если  ТипПодключения =  Перечисления.ТипыПодключения.ПодключениеHTTP
		Или ТипПодключения.Пустая() Тогда
		
		ПроверяемыеРеквизиты.Добавить("ИмяПубликации");
		ПроверяемыеРеквизиты.Добавить("КорневойURL");                   
		ПроверяемыеРеквизиты.Добавить("ИмяПользователяСервиса");             
		ПроверяемыеРеквизиты.Добавить("ПарольСервиса");                                  
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
